app/controllers/pics_controller.rb

	def index
		@pics = Pic.all.order("created_at DESC")
---
SELECT "pics".* FROM "pics"  ORDER BY created_at DESC

	def create
		@pic = Pic.new(pic_params)

		if @pic.save
---
INSERT INTO "pics" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "First Picture"], ["description", "lasjflkadjlflkafa"], ["created_at", "2016-01-07 19:00:16.421756"], ["updated_at", "2016-01-07 19:00:16.421756"]]

	def update
		if @pic.update(pic_params)
---
UPDATE "pics" SET "title" = ?, "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "pics"."id" = ?

	def destroy
		@pic.destroy
---
DELETE FROM "pics" WHERE "pics"."id" = ?  [["id", 1]]

	def find_pic
		@pic = Pic.find(params[:id])
---
SELECT  "pics".* FROM "pics" WHERE "pics"."id" = ? LIMIT 1  [["id", 6]]